{"text": "My 16-year-old daughter has been missing since yesterday evening. She went to the market and never returned. We cannot reach her phone.", "category": "Kidnapping / Abduction / Missing Person (BNS 140–151)"}
{"text": "A stranger has been following my sister for the past week. He waits outside her office and follows her home every day. She is scared.", "category": "Harassment / Threats / Stalking (BNS 351–353)"}
{"text": "I was assaulted by my neighbor during an argument. He punched me in the face and broke my nose. I have medical reports.", "category": "Assault / Hurt / Violence (BNS 115–140)"}
{"text": "Someone hacked my bank account and transferred Rs 50,000 to an unknown account. I received a phishing email before this happened.", "category": "Cybercrime (IT Act + BNS mapping)"}
{"text": "My colleague touched me inappropriately at the office party. This has happened multiple times and I feel unsafe at work.", "category": "Sexual Offences (BNS 63–70)"}
{"text": "A car hit my motorcycle and fled the scene. I sustained serious injuries and the driver did not stop to help.", "category": "Accident / Hit & Run (BNS 106, 112, 279)"}
{"text": "Someone stole my laptop and phone from my car while it was parked outside the mall.", "category": "Theft & Robbery (BNS 303–309)"}
{"text": "A person sold me fake gold jewelry claiming it was genuine. I paid Rs 2 lakhs and later found out it was fake.", "category": "Fraud / Cheating / Financial Crimes (BNS 318–324)"}
{"text": "My husband beats me regularly and threatens to kill me if I tell anyone. I have injury marks on my body.", "category": "Women & Child Safety (BNS 86 + POCSO)"}
{"text": "Someone broke into my house last night and stole cash and jewelry worth Rs 1 lakh.", "category": "Trespass / Housebreaking / Property Disputes (BNS 332–335)"}
{"text": "A minor girl from our neighborhood has been missing for 3 days. Her parents suspect she was abducted.", "category": "Kidnapping / Abduction / Missing Person (BNS 140–151)"}
{"text": "My ex-boyfriend keeps sending me threatening messages on social media saying he will harm me if I don't meet him.", "category": "Harassment / Threats / Stalking (BNS 351–353)"}
{"text": "I was beaten by a group of people during a road rage incident. They attacked me with sticks and damaged my vehicle.", "category": "Assault / Hurt / Violence (BNS 115–140)"}
{"text": "I received a fake job offer email asking for Rs 10,000 as registration fee. After paying, they blocked all communication.", "category": "Cybercrime (IT Act + BNS mapping)"}
{"text": "A man tried to molest my daughter in the park. She managed to escape but is traumatized.", "category": "Sexual Offences (BNS 63–70)"}
{"text": "A truck hit my car from behind and the driver ran away. My car is badly damaged and I have whiplash injury.", "category": "Accident / Hit & Run (BNS 106, 112, 279)"}
{"text": "Two men on a bike snatched my purse while I was walking on the street. It had cash and all my important documents.", "category": "Theft & Robbery (BNS 303–309)"}
{"text": "An agent promised me a job abroad and took Rs 3 lakhs but never provided any documents or job.", "category": "Fraud / Cheating / Financial Crimes (BNS 318–324)"}
{"text": "My neighbor's 8-year-old son has visible burn marks. I suspect the parents are abusing the child.", "category": "Women & Child Safety (BNS 86 + POCSO)"}
{"text": "Unknown people entered my farmland and are refusing to leave. They claim they bought the property.", "category": "Trespass / Housebreaking / Property Disputes (BNS 332–335)"}
{"text": "My teenage son went to school but never reached. His phone is switched off and no one has seen him.", "category": "Kidnapping / Abduction / Missing Person (BNS 140–151)"}
{"text": "A man has been standing outside my house for days and taking pictures. When I confront him, he threatens me.", "category": "Harassment / Threats / Stalking (BNS 351–353)"}
{"text": "During a fight at a wedding, someone stabbed me with a knife. I am hospitalized with serious injuries.", "category": "Assault / Hurt / Violence (BNS 115–140)"}
{"text": "My Instagram account was hacked and the hacker is posting inappropriate content and asking my contacts for money.", "category": "Cybercrime (IT Act + BNS mapping)"}
{"text": "I was raped by someone I met on a dating app. He forced himself on me despite my refusal.", "category": "Sexual Offences (BNS 63–70)"}
{"text": "A speeding car hit a pedestrian near my house and drove away. The victim is critically injured.", "category": "Accident / Hit & Run (BNS 106, 112, 279)"}
{"text": "Armed robbers broke into my shop and took cash from the register at gunpoint.", "category": "Theft & Robbery (BNS 303–309)"}
{"text": "A company promised high returns on investment and took Rs 5 lakhs from me. Now they are not responding to calls.", "category": "Fraud / Cheating / Financial Crimes (BNS 318–324)"}
{"text": "My daughter's teacher has been making inappropriate comments to her. She is scared to go to school.", "category": "Women & Child Safety (BNS 86 + POCSO)"}
{"text": "Someone built a wall on my property boundary. When I asked them to remove it, they threatened me.", "category": "Trespass / Housebreaking / Property Disputes (BNS 332–335)"}
{"text": "A newspaper published false information about me that damaged my reputation in the community.", "category": "Defamation / Public Order Offences (BNS 356–357, 147–150)"}
{"text": "My elderly mother was kidnapped from the hospital. The kidnappers are demanding Rs 10 lakhs ransom.", "category": "Kidnapping / Abduction / Missing Person (BNS 140–151)"}
{"text": "My former employee keeps calling me with abusive language and threatens to harm my family.", "category": "Harassment / Threats / Stalking (BNS 351–353)"}
{"text": "I was attacked with acid by someone. I have severe burns on my face and arms.", "category": "Assault / Hurt / Violence (BNS 115–140)"}
{"text": "Scammers created a fake website of my business and are collecting payments from customers.", "category": "Cybercrime (IT Act + BNS mapping)"}
{"text": "A family member sexually abused me for years. I want to file a complaint but I'm scared.", "category": "Sexual Offences (BNS 63–70)"}
{"text": "A drunk driver crashed into my parked car and left without leaving any contact information.", "category": "Accident / Hit & Run (BNS 106, 112, 279)"}
{"text": "Thieves broke the lock of my shop and stole electronics worth Rs 2 lakhs.", "category": "Theft & Robbery (BNS 303–309)"}
{"text": "Someone used my PAN card and Aadhar to take loans. Now I'm receiving recovery notices.", "category": "Fraud / Cheating / Financial Crimes (BNS 318–324)"}
{"text": "I witnessed a man beating a small child brutally in public. The child was crying for help.", "category": "Women & Child Safety (BNS 86 + POCSO)"}
{"text": "My neighbor illegally occupied part of my house while I was away. They refuse to vacate.", "category": "Trespass / Housebreaking / Property Disputes (BNS 332–335)"}
{"text": "Someone spread false rumors about my character on social media. It has affected my personal and professional life.", "category": "Defamation / Public Order Offences (BNS 356–357, 147–150)"}
{"text": "My brother went missing after attending a party. We found his car abandoned but no sign of him.", "category": "Kidnapping / Abduction / Missing Person (BNS 140–151)"}
{"text": "A stranger has been sending me obscene messages and pictures on WhatsApp despite blocking multiple numbers.", "category": "Harassment / Threats / Stalking (BNS 351–353)"}
{"text": "I was beaten up by a mob during a political rally. I suffered fractures and internal injuries.", "category": "Assault / Hurt / Violence (BNS 115–140)"}
{"text": "I received an email claiming I won a lottery and asking for bank details. I shared my details and money was withdrawn.", "category": "Cybercrime (IT Act + BNS mapping)"}
{"text": "I was drugged and sexually assaulted at a party. I woke up with no memory and injuries.", "category": "Sexual Offences (BNS 63–70)"}
{"text": "A bike rider hit my child while she was crossing the road and escaped without stopping.", "category": "Accident / Hit & Run (BNS 106, 112, 279)"}
{"text": "Burglars entered my house through the window and stole gold ornaments and cash.", "category": "Theft & Robbery (BNS 303–309)"}
{"text": "A person sold me a plot of land that doesn't exist. I paid full amount and now he's missing.", "category": "Fraud / Cheating / Financial Crimes (BNS 318–324)"}
{"text": "My wife is being harassed by my family members for dowry. They threaten to throw her out.", "category": "Women & Child Safety (BNS 86 + POCSO)"}
{"text": "Someone forcibly entered my office premises and damaged property. They claim ownership of the building.", "category": "Trespass / Housebreaking / Property Disputes (BNS 332–335)"}
{"text": "A person made defamatory remarks about me during a public meeting that harmed my reputation.", "category": "Defamation / Public Order Offences (BNS 356–357, 147–150)"}
{"text": "I found an abandoned child near the railway station. The child cannot speak and appears to be traumatized.", "category": "Kidnapping / Abduction / Missing Person (BNS 140–151)"}
{"text": "Someone is blackmailing me with my private photos and demanding money to not release them publicly.", "category": "Harassment / Threats / Stalking (BNS 351–353)"}
{"text": "I was attacked with a sharp weapon during a property dispute. I have deep cuts and required stitches.", "category": "Assault / Hurt / Violence (BNS 115–140)"}
{"text": "Hackers locked my computer files and are demanding Bitcoin payment to unlock them.", "category": "Cybercrime (IT Act + BNS mapping)"}
{"text": "A minor was sexually assaulted in our building. The suspect is known to the family.", "category": "Sexual Offences (BNS 63–70)"}
{"text": "A vehicle hit our cow on the highway and didn't stop. The cow died on the spot.", "category": "Accident / Hit & Run (BNS 106, 112, 279)"}
{"text": "Someone stole my motorcycle from the parking lot. I have the registration details and CCTV footage.", "category": "Theft & Robbery (BNS 303–309)"}
{"text": "I invested in a cryptocurrency scheme that turned out to be a Ponzi scheme. I lost Rs 8 lakhs.", "category": "Fraud / Cheating / Financial Crimes (BNS 318–324)"}
{"text": "A teacher has been physically punishing students brutally. My child has marks on his back.", "category": "Women & Child Safety (BNS 86 + POCSO)"}
{"text": "Unauthorized construction is happening on my ancestral property. The builders are threatening us.", "category": "Trespass / Housebreaking / Property Disputes (BNS 332–335)"}
{"text": "A group of people created disturbance during a religious procession leading to stone pelting.", "category": "Defamation / Public Order Offences (BNS 356–357, 147–150)"}
{"text": "Someone poisoned the street dogs in our locality. Several dogs died and we suspect a resident.", "category": "Other / Cannot Classify"}
{"text": "I want to report illegal sand mining happening near the river. The operators are damaging the environment.", "category": "Other / Cannot Classify"}
{"text": "There is illegal liquor sale happening in our area. The shop operates without license.", "category": "Other / Cannot Classify"}